# решить задачу с помощью метода ветвей и границ
# Пока почитайте про метод ветвей и границ и метод мультистарта
# f = 17*x1 + 30*x2 + 75*x3;
# f -> min;
# g1 = 1.5*x1 + 2.5*x2 + 6*x3 <= 20;
# g2 = 1.5*x1 + 2.5*x2 + 6*x3 >= 19;
#
# f = 20*x1 + 25*x2 + 80*x3;
# f -> min;
# g1 = 1.75*x1 + 2.0*x2 + 5.5*x3 <= 20;
# g2 = 1.75*x1 + 2.0*x2 + 5.5*x3 >= 20
#
# f = 17*x1 + 30*x2 + 75*x3;
# f -> min;
# g1 = 1.0*x1 + 2.2*x2 + 4*x3 <= 15;
# g2 = 1.0*x1 + 2.2*x2 + 4*x3 >= 13;
#
# f = 15*x1 + 40*x2 + 65*x3;
# f -> min;
# g1 = 1.0*x1 + 3.0*x2 + 4.5*x3 <= 25;
# g2 = 1.0*x1 + 3.0*x2 + 4.5*x3 >= 23;
#
# f = 12*x1 + 35*x2 + 76*x3;
# f -> min;
# g1 = 0.5*x1 + 1.5*x2 + 2*x3 <= 10;
# g2 = 0.5*x1 + 1.5*x2 + 2*x3 >= 9;
#
# f = 21*x1 + 35*x2 + 50*x3;
# f -> min;
# g1 = 2.5*x1 + 5*x2 + 10*x3 <= 40;
# g2 = 2.5*x1 + 5*x2 + 10*x3 >= 35;
